In [17]:
import pandas as pd

data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Math': [85, 92, 78, 90, 88],
    'Science': [89, 94, 75, 91, 87],
    'English': [92, 88, 82, 85, 90],
    'Grade': ['A', 'A', 'B', 'A', 'B'],
    'Passed': [True, True, True, True, True]
}

df = pd.DataFrame(data)
print(df)
print(df.loc[df["Grade"] == "A",["Name", "Science"]])
print(df.iloc[2, [1,2,3]])
print(df.at[4, "English"])
print(df.iat[1,1])
df.query('Math > 85 and Passed == True')

      Name  Math  Science  English Grade  Passed
0    Alice    85       89       92     A    True
1      Bob    92       94       88     A    True
2  Charlie    78       75       82     B    True
3    David    90       91       85     A    True
4      Eva    88       87       90     B    True
    Name  Science
0  Alice       89
1    Bob       94
3  David       91
Math       78
Science    75
English    82
Name: 2, dtype: object
90
92

    Name  Math  Science  English Grade  Passed
1    Bob    92       94       88     A    True
3  David    90       91       85     A    True
4    Eva    88       87       90     B    True